/****************************************Copyright (c)**************************************************
**--------------文件信息--------------------------------------------------------------------------------
**文   件   名: UART_grade.c
**创   建   人: 
**最后修改日期: 2018年9月20日
**描        述: 测量档位命令处理
**              
**--------------历史版本信息----------------------------------------------------------------------------
** 创建人: 
** 版  本: v1.00
** 日　期: 2017年12月06日
** 描　述: 原始版本
**
********************************************************************************************************/
#include <rtthread.h>
#include "board.h"
#include "drv_usart.h"
#include "stm32f4xx_hal.h"
#include "UART_Protocol.h"

/*************************************************************************************************/
// grade 测量档位命令处理
/*************************************************************************************************/
void GRADE_getCMD(char *p)
{
	getCMD_ACK(	"@SIC,,GET,GRADE,",
				&Sys_CB_Copy.Grade.grade,
				Byte_Type
				);		
}
void GRADE_setCMD(char *p)
{
	uint32_t tmp_int;
//	档位取值0-7默认15米档
//	0：自动换挡       1：8米档       2：15米档      3：30米档
//	4：60米档         5：120米档    6：240米档      7：300米档
	Str_to_Long(p,&tmp_int);
	Sys_CB_Copy.Grade.grade = tmp_int;
	setCMD_ACK(	"@SIC,,SET,GRADE,",
				&Sys_CB_Copy.Grade.grade,
				Byte_Type
				);	

}

